## Frequent category imputation - pandas



To download the House Prices dataset, please refer to the lecture **Datasets** in **Section 2** of this course.

In [15]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [16]:
# Two categorical columns and the target SalePrice

cols_to_use = ["BsmtQual", "FireplaceQu", "SalePrice"]

In [17]:
# Let's load the House Prices dataset.

data = pd.read_csv("../../Datasets/houseprice.csv", usecols=cols_to_use)

data.head(20)

   BsmtQual FireplaceQu  SalePrice
0        Gd         NaN     208500
1        Gd          TA     181500
2        Gd          TA     223500
3        TA          Gd     140000
4        Gd          TA     250000
5        Gd         NaN     143000
6        Ex          Gd     307000
7        Gd          TA     200000
8        TA          TA     129900
9        TA          TA     118000
10       TA         NaN     129500
11       Ex          Gd     345000
12       TA         NaN     144000
13       Gd          Gd     279500
14       TA          Fa     157000
15       TA         NaN     132000
16       TA          TA     149000
17      NaN         NaN      90000
18       TA         NaN     159000
19       TA         NaN     139000

**Remember that the frequent category must be identified by using the train set only.**

In [18]:
# Let's separate into training and testing sets.

X_train, X_test, y_train, y_test = train_test_split(
    data.drop("SalePrice", axis=1),
    data["SalePrice"],
    test_size=0.3,
    random_state=0,
)

X_train.shape, X_test.shape

((1022, 2), (438, 2))

Check the training data (before imputation):

In [19]:
X_train.head(10)

     BsmtQual FireplaceQu
64         Gd         NaN
682        Gd          Gd
960        TA         NaN
1384       TA         NaN
1100       TA         NaN
416        TA          TA
1034       Fa          Gd
853        TA          Fa
472        Gd         NaN
1011      NaN         NaN

Check the testing data (before imputation):

In [29]:
X_test.head(20)

     BsmtQual FireplaceQu
529        TA          TA
491        TA          TA
459        TA          TA
279        Gd          TA
655        TA          Gd
1013       TA          Gd
1403       Gd          Gd
601        TA          Gd
1182       Ex          TA
687        Gd          Gd
1317       Ex          Gd
1003       TA          Gd
1300       Gd          TA
1392       TA          Po
1014       TA          Gd
254        TA          Gd
1322       Gd          TA
89         Gd          Gd
31         TA          Gd
482        TA          Gd

In [21]:
# Find missing data

X_train.isnull().mean() #Looks for "NA"s in each column and calculates the proportion of missing values.

BsmtQual       0.023483
FireplaceQu    0.467710
dtype: float64

In [22]:
# Calculate the mode

# Mode means the most frequent category which is TA for BsmtQual and Gd for FireplaceQu

X_train[["BsmtQual", "FireplaceQu"]].mode()

  BsmtQual FireplaceQu
0       TA          Gd

Some variables may have more than 1 mode. In this case, we need to decide which category to use as replacement for the NaN values.

It totally depends on us

In [23]:
# Capture the mode of the variables in
# a dictionary
# Capturing the values which we will use for imputation and storing them in a dictionary

imputation_dict = X_train[["BsmtQual", "FireplaceQu"]].mode().iloc[0].to_dict()

imputation_dict

{'BsmtQual': 'TA', 'FireplaceQu': 'Gd'}

In [24]:
# Replace missing data

X_train.fillna(imputation_dict, inplace=True)
X_test.fillna(imputation_dict, inplace=True)

In [25]:
# Corroborate replacement
# Now we have no "NA"s in the training set

X_train.isnull().sum()

BsmtQual       0
FireplaceQu    0
dtype: int64

Verify

In [26]:
X_train.head(10) #Notice, how the NaN values have been replaced with the most frequent categories.

     BsmtQual FireplaceQu
64         Gd          Gd
682        Gd          Gd
960        TA          Gd
1384       TA          Gd
1100       TA          Gd
416        TA          TA
1034       Fa          Gd
853        TA          Fa
472        Gd          Gd
1011       TA          Gd

In [27]:
# Corroborate replacement
# Now we have no "NA"s in the testing set
X_test.isnull().sum()

BsmtQual       0
FireplaceQu    0
dtype: int64

Verify the test data

In [28]:
X_train.head(10) #Notice how the NaN values have been replaced with the most frequent categories.

     BsmtQual FireplaceQu
64         Gd          Gd
682        Gd          Gd
960        TA          Gd
1384       TA          Gd
1100       TA          Gd
416        TA          TA
1034       Fa          Gd
853        TA          Fa
472        Gd          Gd
1011       TA          Gd